/*
 * Exercise 5
 *
 * (Ανάπλαση από διαπεράσεις δυαδικού δένδρου) Εξηγήστε πως αν έχουμε στη
 * διάθεσή μας μία μεταδιαπέραση (μεταδιάταξη) και μία ενδοδιαπέραση
 * (ενδοδιάταξη) τότε μπορούμε να αναπλάσουμε την μορφή του δυαδικού δένδρου.
 * Υλοποιήστε κυρίως πρόγραμμα το οποίο διαβάζει μία ενδοδιαπέραση και μία
 * μεταδιαπέραση. Θεωρούμε για απλότητα ότι το δένδρο περιέχει χαρακτήρες
 * μοναδικούς μεταξύ τους, οπότε οι δύο διαπεράσεις μπορούν να διαβαστούν και να
 * αποθηκευτούν σαν δύο συμβολοσειρές. Επίσης θεωρούμε ότι ανάπλαση δένδρου
 * σημαίνει εύρεση για κάθε κόμβο αριστερού και δεξιού παιδιού και επιστροφή της ρίζας.
 *
 * Κάντε το ίδιο θεωρώντας ότι οι διαπεράσεις που έχουμε διαθέσιμες είναι
 * προδιαπέραση και όχι μεταδιαπέραση.
 *
 * Επιβεβαιώστε το αποτέλεσμα, καλώντας μία από τις συναρτήσεις διαπέρασης που
 * ορίσαμε στο ερώτημα 4.
 *
 * Τεστάρετε τη συνάρτηση με ένα κυρίως πρόγραμμα με δεδομένα της επιλογής σας και
 * δοκιμάστε ενδεχομένως και διαφορετικές υλοποιήσεις
*/