/*
 * Exercise 4
 *
 * Αξιοποιώντας τις διαπεράσεις του προηγούμενου ερωτήματος, υπολογίστε:
 *
 * (Ύψος δυαδικού δέντρου) Υλοποιήστε μια συνάρτηση που λαμβάνει ως όρισμα ένα
 * δείκτη στη ρίζα ενός δυαδικού δέντρου και επιστρέφει το ύψος του. Τεστάρετε τη
 * συνάρτηση με ένα κυρίως πρόγραμμα με δεδομένα της επιλογής σας.
 *
 * (Βάθος κόμβων) Υλοποιήστε μία συνάρτηση η οποία λαμβάνει ως όρισμα ένα δείκτη
 * στη ρίζα ενός δυαδικού δέντρου και για κάθε κόμβο υπολογίζει και εκτυπώνει το βάθος
 * του. Τεστάρετε τη συνάρτηση με ένα κυρίως πρόγραμμα με δεδομένα της επιλογής σας
*/