/*
 * Exercise 1
 * Υλοποιήστε συνάρτηση που χρησιμοποιεί στοίβα
 * χαρακτήρων για να ελέγξει αν μια έκφραση περιέχει σωστά τοποθετημένες
 * παρενθέσεις (), αγκύλες [] και άγκιστρα {}. Η συνάρτηση πρέπει να επιστρέφει 1 αν η
 * έκφραση είναι σωστή διαφορετικά 0. Τεστάρετε τη συνάρτηση με ένα κυρίως
 * πρόγραμμα με δεδομένα της επιλογής σας και δοκιμάστε ενδεχομένως και
 * διαφορετικές υλοποιήσεις (λίστα ή πίνακας για τη στοίβα που θα χρησιμοποιήσετε).
*/
#include <stdio.h>
#include <string.h>
#define LENGTH 100

int check(char* ekfrash) {
    char stack[LENGTH];     // πινακας
    int pos = -1;           // δεικτης π δειχνει στην κορυφη του πινακα
    int len = strlen(ekfrash);

    for (int i = 0; i < len; i++) {
        char ch = ekfrash[i];   // loop καθε εναν χαρακτηρα της εκφρασης
        if (ch == '(' || ch == '[' || ch == '{') {
            stack[++pos] = ch;  // τα βαζω στον πινακα στη θεση που ηταν πριντ (top)+1
        }

        else if (ch == ')' || ch == ']' || ch == '}') {
            if (pos == -1) return 0;    // Wrong αν ο 1ος χαρακτηρας ειναι ')', '}', ']' ειναι αυτοματα λαθος

            char prohgoymeno = stack[pos--];   // Βγαζω το τελευταιο που μπηκε στη στοιβα και κοιταω αν ταιριαζει

            // ch ο χαρακτηρας π ηρθε τωρα και prohgoymeno ο προηγουμενος χαρακτηρας
            if ((ch == ')' && prohgoymeno != '(') || (ch == ']' && prohgoymeno != '[') || (ch == '}' && prohgoymeno != '{')) {
                return 0;
            }               // Αν ταιριαζει με το τελευταιο που μπηκε συνεχιζω αλλιως ειναι λαθος
        }
    }
    return (pos == -1) ? 1 : 0; // αν ειμαστε στην αρχη του πινακα ειναι σωστο αλλιως ειναι λαθος
}

int main() {
    char ekfrash[LENGTH];
    printf("ekfrash: ");
    fgets(ekfrash, LENGTH, stdin);
    printf(check(ekfrash) ? "Correct!" : "Wrong!");
}