/*
 *Exercise 3
 * (i) (Διέλευση δυαδικού δέντρου κατά επίπεδα)
 * Αυτή η άσκηση παρουσιάζει τη διαπέραση κατά επίπεδα ενός δυαδικού δέντρου.
 * Αυτή η διέλευση εμφανίζει τις τιμές των κόμβων από επίπεδο προς επίπεδο και από
 * αριστερά προς τα δεξιά, ξεκινώντας από το επίπεδο της ρίζας. Ο αλγόριθμος δεν είναι
 * αναδρομικός αλλά χρησιμοποιεί τη δομή δεδομένων ουρά για την επεξεργασία των κόμβων με τη σωστή σειρά.
 *
 * Ο αλγόριθμος έχει ως εξής:
 *  1. Εισάγετε την ρίζα στην ουρά.
 *  2. Ενόσω υπάρχουν κόμβοι στην ουρά,
 *      ✓ Πάρε τον επόμενο κόμβο στην ουρά.
 *      ✓ Εκτύπωσε την τιμή του κόμβου.
 *      ✓ Εάν ο δείκτης στο αριστερό παιδί του κόμβου δεν είναι NULL, να
 *          εισάγετε το αριστερό παιδί στην ουρά.
 *      ✓ Εάν ο δείκτης στο δεξιό παιδί του κόμβου δεν είναι NULL να εισάγετε
 *      το δεξιό παιδί στην ουρά.
 * Γράψτε συνάρτηση με το όνομα levelOrder για να εκτελέσετε μια διαπέραση κατά
 * επίπεδα ενός δυαδικού δέντρου. Η συνάρτηση θα πρέπει να λαμβάνει ως όρισμα έναν
 * δείκτη στη ρίζα του δυαδικού δέντρου. Τεστάρετε τη συνάρτηση με ένα κυρίως
 * πρόγραμμα με δεδομένα της επιλογής σας και δοκιμάστε ενδεχομένως και
 * διαφορετικές υλοποιήσεις (λίστα ή πίνακας για την ουρά που θα χρησιμοποιήσετε).
 *
 * (ii) (Διελεύσεις δυαδικού δέντρου)
 * Αντίστοιχα υλοποιήστε προδιάταξη (προδιατεταγμένη διαπέραση) και
 * μεταδιάταξη (μεταδιατεταγμένη διαπέραση). Τεστάρετε τη συνάρτηση με ένα
 * κυρίως πρόγραμμα με δεδομένα της επιλογής σας
*/
