/*
 * Exercise 2
 *
 * Υλοποιήστε συνάρτηση με το όνομα binaryTreeSearch που επιχειρεί να εντοπίσει μια
 * καθορισμένη τιμή σε ένα δυαδικό δέντρο αναζήτησης με ακεραίους σαν περιεχόμενο.
 * Η συνάρτηση θα πρέπει να λαμβάνει ως ορίσματα έναν δείκτη στη ρίζα του δυαδικού
 * δέντρου και ένα κλειδί αναζήτησης που πρέπει να εντοπιστεί. Εάν βρεθεί ο κόμβος που
 * περιέχει το κλειδί αναζήτησης, η συνάρτηση θα πρέπει να επιστρέψει έναν δείκτη σε
 * αυτόν τον κόμβο. Διαφορετικά, η συνάρτηση θα πρέπει να επιστρέψει έναν δείκτη NULL.
 *
 * Υλοποιήστε επίσης συναρτήσεις ένθεσης και διαγραφής τιμής από το δέντρο
 *
 * Τεστάρετε τη συνάρτηση με ένα κυρίως πρόγραμμα με δεδομένα της επιλογής σας.
 * Υλοποιήστε είτε φυλλοπροσανατολισμένο είτε κομβοπροσανατολισμένο δέντρο.
 *
 * Εξηγήστε (θεωρητικά) την διαφοροποίηση στις δύο επιλογές υλοποίησης και πως
 * θα άλλαζε ο κώδικας αν επιλέγατε διαφορετική υλοποίηση.
*/

